module.exports = {
    scanning: {
        noWebhooksTitle: "🚫 لم يتم العثور على اي ويب هوك نشط",
        noWebhooksDesc: "لم يتم الكشف عن أي ويب هوك نشط في قنوات السيرفر.",
        reportTitle: "📋 تقرير الويب هوك",
        buttonLabel: "🔄 إعادة الفحص",
        successScan: "✅ تم إكمال فحص الويب هوك وإرسال التقرير!",
        rescanNotice: "🔄 يتم الآن إعادة فحص جميع الويب هوك في السيرفر وإرسال تقرير جديد...",
        noPermission: "❌ ليس لديك صلاحية لاستخدام هذا الزر."
    },
    security: {
        detectedTitle: "**🚨 تم الكشف عن ويب هوك مشبوه!**",
        deleted: "تم حذفه بنجاح.",
        creator: "👤 المنشئ :",
        webhookId: "🕸 معرف الويب هوك :",
        channel: "📍 القناة :",
        count: "💬 عدد الرسائل :",
        reason: "❓ السبب :"
    },
    audit: {
        createdTitle: "تم إنشاء ويب هوك جديد",
        deletedTitle: "تم حذف ويب هوك",
        name: "💬 اسم الويب هوك :",
        webhookId: "🕸 معرف الويب هوك :",
        channel: "📍 القناة :",
        createdBy: "👤 تم إنشاءه من قبل :",
        deletedBy: "👤 تم حذفه من قبل :"
    }
};
